# Real-world Data Wrangling  
**Fullname:** Nguyen Van Khang  
**ID:** 23IT121  
**Class:** 23SE2

## 1. Gather data

### **1.1.** Problem Statement

## This project aims to practice my skills of data wrangling using real-world datasets.

### In this dataset, I would like to answer the following research questions:

#### Question 1: Khu vực nào có nhiều chỗ ở nhất

#### Question 2: Chủ nhà có nhiều chỗ cho thuê nhất?

#### Question 3: Trung bình một chỗ ở có bao nhiêu phòng ngủ?

In [ ]:

import pandas as pd
import numpy as np
# Dung thu vien Pandas de doc file CSV
df = pd.read_csv(r'D:\dataset\messy\calendar1.csv')
df1 = pd.read_csv(r'D:\dataset\messy\listing.csv')

In [ ]:
# Q1
most_listings_region = df1['neighbourhood_group_cleansed'].value_counts().idxmax()
print("Khu vực có nhiều chỗ ở nhất:", most_listings_region)

Khu vực có nhiều chỗ ở nhất: Other neighborhoods

In [ ]:
# Q2
top_host = df1['Owner ID'].value_counts().idxmax()
print("Chủ nhà có nhiều chỗ cho thuê nhất:", top_host)

Chủ nhà có nhiều chỗ cho thuê nhất: 4962900

In [ ]:
# Q3
average_bedrooms = df1['Bedrooms'].mean()
print("Trung bình số phòng ngủ:", round(average_bedrooms, 2))

Trung bình số phòng ngủ: 1.33

In [16]:
# Import cac thu vien can thiet
import pandas as pd 
import numpy as np
df

             ID       date available  price
0        241032   1/4/2016         t   85.0
1        241032   1/5/2016         t   85.0
2        241032   1/6/2016         f    NaN
3        241032   1/7/2016         f    NaN
4        241032   1/8/2016         f    NaN
...         ...        ...       ...    ...
276286  6824408  5/24/2016         f    NaN
276287  6824408  5/25/2016         f    NaN
276288  6824408  5/26/2016         f    NaN
276289  6824408  5/27/2016         f    NaN
276290  6824408  5/28/2016         f    NaN

[276291 rows x 4 columns]

### **1.2.** Gather at least two datasets using two different data gathering methods

In [ ]:
# Dung thu vien Pandas de doc file CSV
df = pd.read_csv(r'D:\dataset\messy\calendar1.csv')
df1 = pd.read_csv(r'D:\dataset\messy\listing.csv')

In [ ]:
# Hien thi 5 hang dau cua Dataframe thu 1
df.head()

   listing_id      date available    price
0      241032  1/4/2016         t  $85.00
1      241032  1/5/2016         t  $85.00
2      241032  1/6/2016         f      NaN
3      241032  1/7/2016         f      NaN
4      241032  1/8/2016         f      NaN

In [ ]:
# Hien thi 5 hang dau cua Dataframe thu 2
df1.head()

,id,name,summary,space,description,host_id,host_name,neighbourhood_group_cleansed,city,country_code,...,property_type,room_type,accommodates,bathrooms,bedrooms,beds,bed_type,amenities,square_feet,price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,Make your self at home in this charming one-be...,956883,Maija,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,$85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",Chemically sensitive? We've removed the irrita...,5177328,Andrea,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",NaN,$150.00
2,3308979,New Modern House-Amazing water view,New modern house built in 2013. Spectacular s...,"Our house is modern, light and fresh with a wa...",New modern house built in 2013. Spectacular s...,16708587,Jill,Queen Anne,Seattle,US,...,House,Entire home/apt,11,4.5,5.0,7.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",NaN,$975.00
3,7421966,Queen Anne Chateau,A charming apartment that sits atop Queen Anne...,NaN,A charming apartment that sits atop Queen Anne...,9851441,Emily,Queen Anne,Seattle,US,...,Apartment,Entire home/apt,3,1.0,0.0,2.0,Real Bed,"{Internet,""Wireless Internet"",Kitchen,""Indoor ...",NaN,$100.00
4,278830,Charming craftsman 3 bdm house,Cozy family craftman house in beautiful neighb...,Cozy family craftman house in beautiful neighb...,Cozy family craftman house in beautiful neighb...,1452570,Emily,Queen Anne,Seattle,US,...,House,Entire home/apt,6,2.0,3.0,3.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",Ki...",NaN,$450.00

## Exploring data set

In [ ]:
# Hien thi thong tin so luoc cua DataFrame thu 1 (gom: Ten Cot, Gia tri Null va Kieu du lieu)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 21 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            3818 non-null   int64
 1   name                          3818 non-null   object
 2   summary                       3641 non-null   object
 3   space                         3249 non-null   object
 4   description                   3818 non-null   object
 5   host_id                       3818 non-null   int64
 6   host_name                     3816 non-null   object
 7   neighbourhood_group_cleansed  3818 non-null   object
 8   city                          3818 non-null   object
 9   country_code                  3818 non-null   object
 10  country                       3818 non-null   object
 11  property_type                 3817 non-null   object
 12  room_type                     3818 non-null   object
 13  accommodates                  3818 non-null   int64
 14  bathrooms                     3802 non-null   float64
 15  bedrooms                      3812 non-null   float64
 16  beds                          3817 non-null   float64
 17  bed_type                      3818 non-null   object
 18  amenities                     3818 non-null   object
 19  square_feet                   97 non-null     float64
 20  price                         3818 non-null   object
dtypes: float64(4), int64(3), object(14)
memory usage: 626.5+ KB

In [ ]:
# Hien thi thong tin so luoc cua DataFrame thu 2 (gom: Ten Cot, Gia tri Null va Kieu du lieu)
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3818 entries, 0 to 3817
Data columns (total 21 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   id                            3818 non-null   int64
 1   name                          3818 non-null   object
 2   summary                       3641 non-null   object
 3   space                         3249 non-null   object
 4   description                   3818 non-null   object
 5   host_id                       3818 non-null   int64
 6   host_name                     3816 non-null   object
 7   neighbourhood_group_cleansed  3818 non-null   object
 8   city                          3818 non-null   object
 9   country_code                  3818 non-null   object
 10  country                       3818 non-null   object
 11  property_type                 3817 non-null   object
 12  room_type                     3818 non-null   object
 13  accommodates                  3818 non-null   int64
 14  bathrooms                     3802 non-null   float64
 15  bedrooms                      3812 non-null   float64
 16  beds                          3817 non-null   float64
 17  bed_type                      3818 non-null   object
 18  amenities                     3818 non-null   object
 19  square_feet                   97 non-null     float64
 20  price                         3818 non-null   object
dtypes: float64(4), int64(3), object(14)
memory usage: 626.5+ KB

In [ ]:
# Dua ra cai nhin tong quan ve du lieu so cua DF thu 1 nham muc dich thong ke mo ta
df.describe()

         listing_id
count  2.762910e+05
mean   5.410025e+06
std    2.948132e+06
min    6.606000e+03
25%    3.121829e+06
50%    5.749958e+06
75%    7.900056e+06
max    1.031037e+07

In [ ]:
# Dua ra cai nhin tong quan ve du lieu so cua DF thu 2 nham muc dich thong ke mo ta
df1.describe()

,id,host_id,accommodates,bathrooms,bedrooms,beds,square_feet
count,3.818000e+03,3.818000e+03,3818.000000,3802.000000,3812.000000,3817.000000,97.000000
mean,5.550111e+06,1.578556e+07,3.349398,1.259469,1.307712,1.735394,854.618557
std,2.962660e+06,1.458382e+07,1.977599,0.590369,0.883395,1.139480,671.404893
min,3.335000e+03,4.193000e+03,1.000000,0.000000,0.000000,1.000000,0.000000
25%,3.258256e+06,3.275204e+06,2.000000,1.000000,1.000000,1.000000,420.000000
50%,6.118244e+06,1.055814e+07,3.000000,1.000000,1.000000,1.000000,750.000000
75%,8.035127e+06,2.590309e+07,4.000000,1.000000,2.000000,2.000000,1200.000000
max,1.034016e+07,5.320861e+07,16.000000,8.000000,7.000000,15.000000,3000.000000

# **Dataset Listing**

 **Problem 1: Check for Missing or Redundant Data (Missing Values)**
 
 **Problem 2: Remove Unnecessary Columns and Rename Columns**
 
 **Problem 3: Standardize Data**
 
 **Problem 4: Handle Anomalous Data**

# **Assess Data**

### Problem 1: Check for Missing or Redundant Data (Missing Values)

In [ ]:
import pandas as pd
# Đọc dữ liệu từ file CSV
df = pd.read_csv(r'D:\dataset\messy\calendar1.csv')
# Bước 1: Chuyển đổi cột 'price' sang kiểu số (loại bỏ dấu '$' và ',' nếu có)
df['price'] = df['price'].astype(str).str.replace(r'[\$,]', '', regex=True)
# Bước 2: Xử lý các giá trị bị thiếu (NaN) trong 'price'
df['price'] = pd.to_numeric(df['price'], errors='coerce')  # Chuyển tất cả về số (float)
df.loc[df['available'] == 'f', 'price'] = 0  # Nếu không khả dụng, đặt giá là 0
df['price'] = df['price'].fillna(df['price'].mean()) # Điền giá trị trung bình cho phần còn lại
# Kiểm tra lại sau khi xử lý
df['available'] = df['available'].replace({'t': 'Yes', 'f': 'No'}).fillna(0)
# Hiển thị 5 dòng đầu tiên để kiểm tra kết quả
df.head()

   listing_id      date available  price
0      241032  1/4/2016       Yes   85.0
1      241032  1/5/2016       Yes   85.0
2      241032  1/6/2016        No    0.0
3      241032  1/7/2016        No    0.0
4      241032  1/8/2016        No    0.0

In [ ]:
import pandas as pd

# Kiểm tra số lượng giá trị NaN
print(df1.isnull().sum())

# Xóa cột 'square_feet' nếu có quá nhiều NaN
df1.drop(columns=['square_feet'], inplace=True)

# Xóa các dòng có quá nhiều giá trị NaN
df1.dropna(thresh=df1.shape[1] * 0.5, inplace=True)

# Điền giá trị NaN cho cột kiểu text
df1.loc[:, 'summary'] = df1['summary'].fillna("No summary available")
df1.loc[:, 'space'] = df1['space'].fillna("No space description")

# Điền giá trị NaN cho cột số bằng mean hoặc mode
df1.loc[:, 'bathrooms'] = df1['bathrooms'].fillna(df1['bathrooms'].mean())
df1.loc[:, 'bedrooms'] = df1['bedrooms'].fillna(df1['bedrooms'].mode()[0])

# Xử lý cột price (loại bỏ ký tự đặc biệt, chuyển sang số)
df1.loc[:, 'price'] = df1['price'].replace(r'[\$,]', '', regex=True).astype(float)
df1.loc[:, 'price'] = df1['price'].fillna(df1['price'].mean())

# Kiểm tra lại sau khi xử lý
print(df1.isnull().sum())

id                                 0
name                               0
summary                          177
space                            569
description                        0
host_id                            0
host_name                          2
neighbourhood_group_cleansed       0
city                               0
country_code                       0
country                            0
property_type                      1
room_type                          0
accommodates                       0
bathrooms                         16
bedrooms                           6
beds                               1
bed_type                           0
amenities                          0
square_feet                     3721
price                              0
dtype: int64
id                              0
name                            0
summary                         0
space                           0
description                     0
host_id                         0
host_name                       2
neighbourhood_group_cleansed    0
city                            0
country_code                    0
country                         0
property_type                   1
room_type                       0
accommodates                    0
bathrooms                       0
bedrooms                        0
beds                            1
bed_type                        0
amenities                       0
price                           0
dtype: int64

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_3404\2267683062.py:22: FutureWarning: Downcasting object dtype arrays on .fillna, .ffill, .bfill is deprecated and will change in a future version. Call result.infer_objects(copy=False) instead. To opt-in to the future behavior, set `pd.set_option('future.no_silent_downcasting', True)`
  df1.loc[:, 'price'] = df1['price'].fillna(df1['price'].mean())

### **Problem 2: Remove Unnecessary Columns and Rename Column Name**

In [12]:
import numpy as np
columns_to_drop = [
    'square_feet',  # Quá nhiều giá trị NaN
    'country_code',  # Thông tin trùng lặp với 'country'
    'description',  # Thông tin gần như trùng với 'summary'
    'host_name',  # Không cần thiết nếu đã có 'host_id'
]
df1.rename(columns={
    'id': 'ID',
    'name': 'Listing Name',
    'summary': 'Listing Summary',
    'space': 'Listing Space',
    'host_id': 'Owner ID',
    'neighbourhood_group_cleansed': 'Region',
    'city': 'City',
    'country': 'Country',
    'property_type': 'Property Type',
    'room_type': 'Room Type',
    'accommodates': 'Guest Capacity',
    'bathrooms': 'Bathrooms',
    'bedrooms': 'Bedrooms',
    'beds': 'Beds',
    'bed_type': 'Bed Type',
    'amenities': 'Amenities',
    'price': 'Price'
}, inplace=True)
# Kiểm tra lại DataFrame sau khi đổi tên
print(df1.head())

# Chỉ giữ lại những cột có trong DataFrame trước khi xóa
existing_columns = [col for col in columns_to_drop if col in df1.columns]

# Nếu có cột hợp lệ, thực hiện xóa
if existing_columns:
    df1.drop(columns=existing_columns, inplace=True)
else:
    print("")

# 2. Kiểm tra tương quan giữa các cột số và loại bỏ cột dư thừa
numeric_df1 = df1.select_dtypes(include=[np.number])
corr_matrix = numeric_df1.corr()
df1.head()

        ID                         Listing Name  \
0   241032         Stylish Queen Anne Apartment
1   953595   Bright & Airy Queen Anne Apartment
2  3308979  New Modern House-Amazing water view
3  7421966                   Queen Anne Chateau
4   278830       Charming craftsman 3 bdm house

                                     Listing Summary  \
0                                                NaN
1  Chemically sensitive? We've removed the irrita...
2  New modern house built in 2013.  Spectacular s...
3  A charming apartment that sits atop Queen Anne...
4  Cozy family craftman house in beautiful neighb...

                                       Listing Space  Owner ID      Region  \
0  Make your self at home in this charming one-be...    956883  Queen Anne
1  Beautiful, hypoallergenic apartment in an extr...   5177328  Queen Anne
2  Our house is modern, light and fresh with a wa...  16708587  Queen Anne
3                                                NaN   9851441  Queen Anne
4  Cozy family craftman house in beautiful neighb...   1452570  Queen Anne

      City        Country Property Type        Room Type  Guest Capacity  \
0  Seattle  United States     Apartment  Entire home/apt               4
1  Seattle  United States     Apartment  Entire home/apt               4
2  Seattle  United States         House  Entire home/apt              11
3  Seattle  United States     Apartment  Entire home/apt               3
4  Seattle  United States         House  Entire home/apt               6

   Bathrooms  Bedrooms  Beds  Bed Type  \
0        1.0       1.0   1.0  Real Bed
1        1.0       1.0   1.0  Real Bed
2        4.5       5.0   7.0  Real Bed
3        1.0       0.0   2.0  Real Bed
4        2.0       3.0   3.0  Real Bed

                                           Amenities     Price
0  {TV,"Cable TV",Internet,"Wireless Internet","A...   $85.00
1  {TV,Internet,"Wireless Internet",Kitchen,"Free...  $150.00
2  {TV,"Cable TV",Internet,"Wireless Internet","A...  $975.00
3  {Internet,"Wireless Internet",Kitchen,"Indoor ...  $100.00
4  {TV,"Cable TV",Internet,"Wireless Internet",Ki...  $450.00

,ID,Listing Name,Listing Summary,Listing Space,Owner ID,Region,City,Country,Property Type,Room Type,Guest Capacity,Bathrooms,Bedrooms,Beds,Bed Type,Amenities,Price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,956883,Queen Anne,Seattle,United States,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",$85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",5177328,Queen Anne,Seattle,United States,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{TV,Internet,""Wireless Internet"",Kitchen,""Free...",$150.00
2,3308979,New Modern House-Amazing water view,New modern house built in 2013. Spectacular s...,"Our house is modern, light and fresh with a wa...",16708587,Queen Anne,Seattle,United States,House,Entire home/apt,11,4.5,5.0,7.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",""A...",$975.00
3,7421966,Queen Anne Chateau,A charming apartment that sits atop Queen Anne...,NaN,9851441,Queen Anne,Seattle,United States,Apartment,Entire home/apt,3,1.0,0.0,2.0,Real Bed,"{Internet,""Wireless Internet"",Kitchen,""Indoor ...",$100.00
4,278830,Charming craftsman 3 bdm house,Cozy family craftman house in beautiful neighb...,Cozy family craftman house in beautiful neighb...,1452570,Queen Anne,Seattle,United States,House,Entire home/apt,6,2.0,3.0,3.0,Real Bed,"{TV,""Cable TV"",Internet,""Wireless Internet"",Ki...",$450.00

 ### **Problem 3: Standalize Data**

In [14]:
import pandas as pd
import re
# Chuẩn hóa giá cột 'Price' (loại bỏ ký tự '$' và chuyển về số)
df['price'] = df['price'].replace('[\\$,]', '', regex=True).astype(float)
# Chuẩn hóa cột 'Amenities' (chuyển về chữ thường, bỏ dấu ngoặc vuông)
df1['Amenities'] = df1['Amenities'].astype(str).str.lower().str.replace(r'[\[\]"]', '', regex=True)
# Xử lý giá trị thiếu (NaN) trong các cột số
df1['Bathrooms'] = df1['Bathrooms'].fillna(df1['Bathrooms'].mean())
df1['Bedrooms'] = df1['Bedrooms'].fillna(df1['Bedrooms'].mode()[0])
df1['Beds'] = df1['Beds'].fillna(df1['Beds'].mode()[0])
df1.head()

,ID,Listing Name,Listing Summary,Listing Space,Owner ID,Region,City,Country,Property Type,Room Type,Guest Capacity,Bathrooms,Bedrooms,Beds,Bed Type,Amenities,Price
0,241032,Stylish Queen Anne Apartment,NaN,Make your self at home in this charming one-be...,956883,Queen Anne,Seattle,United States,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{tv,cable tv,internet,wireless internet,air co...",$85.00
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",5177328,Queen Anne,Seattle,United States,Apartment,Entire home/apt,4,1.0,1.0,1.0,Real Bed,"{tv,internet,wireless internet,kitchen,free pa...",$150.00
2,3308979,New Modern House-Amazing water view,New modern house built in 2013. Spectacular s...,"Our house is modern, light and fresh with a wa...",16708587,Queen Anne,Seattle,United States,House,Entire home/apt,11,4.5,5.0,7.0,Real Bed,"{tv,cable tv,internet,wireless internet,air co...",$975.00
3,7421966,Queen Anne Chateau,A charming apartment that sits atop Queen Anne...,NaN,9851441,Queen Anne,Seattle,United States,Apartment,Entire home/apt,3,1.0,0.0,2.0,Real Bed,"{internet,wireless internet,kitchen,indoor fir...",$100.00
4,278830,Charming craftsman 3 bdm house,Cozy family craftman house in beautiful neighb...,Cozy family craftman house in beautiful neighb...,1452570,Queen Anne,Seattle,United States,House,Entire home/apt,6,2.0,3.0,3.0,Real Bed,"{tv,cable tv,internet,wireless internet,kitche...",$450.00

 ### **Problem 4: Handle Anomalous Data**

In [ ]:
import pandas as pd
# Xác định phạm vi IQR cho cột 'Price'
Q1 = df1['Price'].quantile(0.25)
Q3 = df1['Price'].quantile(0.75)
IQR = Q3 - Q1
# Giới hạn hợp lý cho giá phòng
lower_bound = Q1 - 1.5 * IQR
upper_bound = Q3 + 1.5 * IQR
# Loại bỏ các dòng có giá trị ngoại lai
df1 = df1[(df1['Price'] >= lower_bound) & (df1['Price'] <= upper_bound)]
# Loại bỏ những dòng có số giường, số phòng ngủ hoặc phòng tắm âm hoặc bằng 0
df1 = df1[(df1['Bathrooms'] > 0) & (df1['Bedrooms'] > 0) & (df1['Beds'] > 0)]
# Nếu Room Type là 'Entire Home/Apt' thì số Beds ít nhất phải là 1
df1.loc[(df1['Room Type'] == 'Entire Home/Apt') & (df1['Beds'] == 0), 'Beds'] = 1
# Hiển thị dữ liệu sau khi xử lý
df1.head()

,ID,Listing Name,Listing Summary,Listing Space,Owner ID,Region,City,Country,Property Type,Room Type,Guest Capacity,Bathrooms,Bedrooms,Beds,Bed Type,Amenities,Price
0,241032,Stylish Queen Anne Apartment,No summary available,Make your self at home in this charming one-be...,956883,Queen Anne,Seattle,United States,Apartment,Entire Home/Apt,4,1.0,1.0,1.0,Real Bed,"{tv,cable tv,internet,wireless internet,air co...",85.0
1,953595,Bright & Airy Queen Anne Apartment,Chemically sensitive? We've removed the irrita...,"Beautiful, hypoallergenic apartment in an extr...",5177328,Queen Anne,Seattle,United States,Apartment,Entire Home/Apt,4,1.0,1.0,1.0,Real Bed,"{tv,internet,wireless internet,kitchen,free pa...",150.0
5,5956968,Private unit in a 1920s mansion,We're renting out a small private unit of one ...,If you include a bit of your background in you...,326758,Queen Anne,Seattle,United States,House,Private Room,2,1.0,1.0,1.0,Real Bed,"{wireless internet,free parking on premises,he...",120.0
6,1909058,Queen Anne Private Bed and Bath,Enjoy a quiet stay in our comfortable 1915 Cra...,Enjoy a quiet stay in our comfortable 1915 Cra...,2497928,Queen Anne,Seattle,United States,House,Private Room,2,1.0,1.0,1.0,Real Bed,"{wireless internet,free parking on premises,he...",80.0
7,856550,Tiny Garden cabin on Queen Anne,"Our tiny cabin is private , very quiet and com...","This cabin was built with Airbnb in mind, Que...",4016632,Queen Anne,Seattle,United States,Cabin,Private Room,2,1.0,1.0,1.0,Real Bed,"{wireless internet,pets live on this property,...",60.0

### **Merge Dataset**

In [15]:
# Đổi tên cột 'listing_id' trong df để khớp với 'ID' trong df1
df.rename(columns={'listing_id': 'ID'}, inplace=True)
# Chuẩn hóa cột 'price' trong df (bỏ dấu $ và chuyển về dạng float)
df['price'] = df['price'].replace('[\$,]', '', regex=True).astype(float)
# Merge hai bảng dựa trên 'ID'
merged_df = df1.merge(df, on='ID', how='inner')  # 'inner' để chỉ giữ ID trùng khớp
# Hiển thị kết quả
print(merged_df.head())

       ID                  Listing Name Listing Summary  \
0  241032  Stylish Queen Anne Apartment             NaN
1  241032  Stylish Queen Anne Apartment             NaN
2  241032  Stylish Queen Anne Apartment             NaN
3  241032  Stylish Queen Anne Apartment             NaN
4  241032  Stylish Queen Anne Apartment             NaN

                                       Listing Space  Owner ID      Region  \
0  Make your self at home in this charming one-be...    956883  Queen Anne
1  Make your self at home in this charming one-be...    956883  Queen Anne
2  Make your self at home in this charming one-be...    956883  Queen Anne
3  Make your self at home in this charming one-be...    956883  Queen Anne
4  Make your self at home in this charming one-be...    956883  Queen Anne

      City        Country Property Type        Room Type  Guest Capacity  \
0  Seattle  United States     Apartment  Entire home/apt               4
1  Seattle  United States     Apartment  Entire home/apt               4
2  Seattle  United States     Apartment  Entire home/apt               4
3  Seattle  United States     Apartment  Entire home/apt               4
4  Seattle  United States     Apartment  Entire home/apt               4

   Bathrooms  Bedrooms  Beds  Bed Type  \
0        1.0       1.0   1.0  Real Bed
1        1.0       1.0   1.0  Real Bed
2        1.0       1.0   1.0  Real Bed
3        1.0       1.0   1.0  Real Bed
4        1.0       1.0   1.0  Real Bed

                                           Amenities    Price      date  \
0  {tv,cable tv,internet,wireless internet,air co...  $85.00   1/4/2016
1  {tv,cable tv,internet,wireless internet,air co...  $85.00   1/5/2016
2  {tv,cable tv,internet,wireless internet,air co...  $85.00   1/6/2016
3  {tv,cable tv,internet,wireless internet,air co...  $85.00   1/7/2016
4  {tv,cable tv,internet,wireless internet,air co...  $85.00   1/8/2016

  available  price
0         t   85.0
1         t   85.0
2         f    NaN
3         f    NaN
4         f    NaN

<>:4: SyntaxWarning: invalid escape sequence '\$'
<>:4: SyntaxWarning: invalid escape sequence '\$'
C:\Users\ADMIN\AppData\Local\Temp\ipykernel_21476\4151551644.py:4: SyntaxWarning: invalid escape sequence '\$'
  df['price'] = df['price'].replace('[\$,]', '', regex=True).astype(float)